{
    "items": [
        {
            "cardBg": "https://danielpatrickkoenig.github.io/shared-app-resources/gemquest1.png",
            "bg": ["#06757e", "#a32dc1"],
            "title": "Dentsu Gemquest",
            "description": "Dentsu GemQuest is a promotional game created to promote Dentsu’s research on gaming. It is built using Vue js, Pixi js and Three js.",
            "contribution": "I was responsible for the development of all UI functionality, all the CSS and all the mechanics of the game. Additionally I rigged the model of the crossbow.",
            "mostProudOf": "This game was an internal initiative that was later successfully used to sell similar games to clients.",
            "link": "https://www.dentsugemquest.com/"
        },
        {
            "cardBg": "https://danielpatrickkoenig.github.io/shared-app-resources/subway1.png",
            "bg": ["#fab915", "#008938"],
            "title": "Subway Footlong Season",
            "description": "Subway Footlong Season was a promotional microsite that offered subway members the opportunity to win prizes. It is built using Vue js and Three js with a Node js server side.",
            "contribution": "Working on a team of developers, I was responsible for contributing to the UI development, contributing to the CSS styling, constituting to animation, contributing to front-end API integration, all 3D modeling and all 3D rigging.",
            "mostProudOf": "The client requested a falling potato chip animation between the game result and the reveal of the prize the user had won. The animation was created in three js using 3D potato chips. It turned out to be quite realistic and the client was overjoyed.",
            "link": "video_subway"
        },
        {
            "cardBg": "https://danielpatrickkoenig.github.io/shared-app-resources/gcsym.png",
            "bg": ["#112211", "#112211"],
            "title": "Gamecube Data Symulator",
            "description": "The Gamecube Data Symulator is particle based data visualization with multiple data sorting features, filters and a search funchionality.",
            "contribution": "As the sole developer I was responsible for pocessing the data, cleaning the data, developing the data sorting alcorythms, developing the UI and creating the css styling.",
            "mostProudOf": "This project was done just for fun. It was an opportunity to use my python skills and my front end development skills.",
            "link": "https://danielpatrickkoenig.github.io/n64-sym/build/index.html"
        },
        {
            "cardBg": "https://danielpatrickkoenig.github.io/shared-app-resources/kovak.png",
            "bg": ["#d4e9e2", "#513d2c"],
            "title": "Spirit of Kovak",
            "description": "Spirit of Kovak was a game made as kind of a joke for a D&D campaign I participate in. In this campaign a bard named Kovak had died in our very first session after falling into a pit. I created the game to celebrate the character and for the other players to have a laugh. It was created in Vue js.",
            "contribution": "I was responsible for developing the entire experience and concept. I was also responsible for the design.",
            "mostProudOf": "I am most proud of the joy that it created for the other players in the campaign.",
            "link": "https://danielpatrickkoenig.github.io/spirit-of-kovak/dist/index.html"
        },
        {
            "cardBg": "https://danielpatrickkoenig.github.io/shared-app-resources/crisscrosscrush.png",
            "bg": ["#0066ee", "#0066ee"],
            "title": "Criss Cross Crush",
            "description": "Criss Cross Crush is a grid based puzzle game in which the user can move block by sliding entire rows and columns. The object of the game is to create the specified patterns to destroy groups of blocks.",
            "contribution": "As the sole developer, I was responsible for developing the game engine, UI development and the CSS styling.",
            "mostProudOf": "My favorete part of this project was creating the block sliding game engine and the renderless component to allow any type of block sliding game..",
            "link": "https://danielpatrickkoenig.github.io/criss-cross-demo/dist/index.html"
        },
        {
            "cardBg": "https://danielpatrickkoenig.github.io/shared-app-resources/cope1.png",
            "bg": ["#715c35", "#715c35"],
            "title": "Altria Loyalty",
            "description": "Altria Loyalty was a suite of loyalty programs for several Altria brands. The project was built using Vue js and Node js.",
            "contribution": "I was part of a team that developed a module library used across several Altria loyalty programs. As a part of the dev team for each loyalty program, I was responsible for contributing to UI development, contributing to integrating the module, contributing to API integration and contributing to CSS styling.",
            "mostProudOf": "I am most proud of the creation of the library and the components used across the loyalty programs.",
            "video": "video_altria"
        },
        {
            "cardBg": "https://danielpatrickkoenig.github.io/shared-app-resources/dunkin1.png",
            "bg": ["#ef6a00", "#c63663"],
            "title": "Dunkin Summer",
            "description": "Dunkin Summer Golf was a promotional microsite that offered users the opportunity to win prizes. It is built using Vue js, Pixi js and Three js with a Node js server side.",
            "contribution": "Being one the members of the development team, I was responsible for contributing to the UI Development, contributing to the CSS styling, constituting to animation, contributing to front-end API integration, contributing to 3D modeling and the development of the mini golf game.",
            "mostProudOf": "I am most proud of the mini golf game entirely developed in Three js.",
            "demo": "https://danielpatrickkoenig.github.io/shared-app-resources/dunkin_summer_golf/build/index.html"
        },
        {
            "cardBg": "https://danielpatrickkoenig.github.io/shared-app-resources/dunkin2.png",
            "bg": ["#ef6a00", "#ef6a00"],
            "title": "Dunkin at Home Extras",
            "description": "Dunkin at Home Extras is a loyalty program that gives users an opportunity to participate in activities, upload receipts and earn rewards. It is built using Vue js and Node Js",
            "contribution": "Having been a member of the original development team I was responsible for contributing to UI development, css styling and api integration.",
            "mostProudOf": "I am most proud of refining the drawer functionality to function properly. The drawer was a problem area during the build. I made it my mission to get it to work as gracefully as possible.",
            "link": "https://www.dunkinextras.com"
        },
        {
            "cardBg": "https://danielpatrickkoenig.github.io/shared-app-resources/synchrony1.png",
            "bg": ["#006899", "#fbc600"],
            "title": "Synchrony Let's Get Digital",
            "description": "Synchrony Let’s Get Digital was a promotional microsite that offered users members the opportunity to win prizes. It is built using Vue js, with a Node js server side. The pachinko game depended on an app built using React, Three js and Cannon js to create simulations of the falling pachinko ball.",
            "contribution": "Working on the development team, I was responsible for contributing to the UI Development, contributing to the CSS styling, contributing to the animations, contributing to front-end API integration, creating the simulator that provided all the scenarios used by the game.",
            "mostProudOf": "This game needed to allow users to drop the ball from any position and then fall to a predetermined bucket, provided by the API. It used the Cannon js physics engine to simulate multiple scenarios for every start position leading to all 5 buckets. The result was an experience that looked random and spontaneous.",
            "video": "video_synchronyLGD"
        },
        {
            "cardBg": "https://danielpatrickkoenig.github.io/shared-app-resources/oreo1.png",
            "bg": ["#0058c", "#05AEFF"],
            "title": "Oreo 110th Birthday",
            "description": "Oreo 110th Birthday  was a promotional microsite that offered users the opportunity to win prizes. It is built using Javascript and Perl.",
            "contribution": "As part of the development team, I was responsible for contributing to the UI Development, contributing to the CSS styling, and the majority of animation.",
            "mostProudOf": "The sprinkle confetti. This was achieved entirely with CSS. I developed a tool that allowed for the placement of the confetti with custom configurations for different pages. These configurations were parsed into CSS variables and plugged into a mixin that rendered and animated them.",
            "video": "video_oreo"
        }
    ]
}